import numpy as np

##########################################################
#物理定数
h = 6.62608 * 10**-34 #プランク定数
hbar = h / (2.0 * np.pi)

m0 = 9.10939 * 10**-31 #真空中の電子の質量
m1 = 0.1*m0 #こちらを使う

eV = 1.60217733 * 10**-19 #電子ボルト

e = 1.60217733 * 10**-19 #電気素量

c = 2.99792458E+8 #光速

epsilon0 = 1.0 / (4.0 * np.pi * c * c) * 1.0E+7 #真空の誘電率

kB = 1.38066 * 10**-23
T=300

##########################################################


###########################################################
#実空間・波数空間の離散化
#xvec
r = 30 * 10**-9
l = 0
L = r
Nx = 600
xvec = np.linspace(l,r,Nx)
#delta_x = L/Nx
delta_x = xvec[1]-xvec[0]

#yvec
yvec = xvec


Nk = 300
Nu = 150
delta_k = 0.1 * 10**9
delta_u = (2*np.pi) / (Nk *delta_k)
kvec = np.zeros(Nk) 
for j in range(1,Nk+1): 
    kvec[j-1] = ( 2*np.pi/delta_u ) * ( (j-0.5)/Nk - 0.5 )

uvec = np.zeros(Nu)
for i in range(Nu):
    uvec[i] = i*delta_u

N = Nx * Nk
##########################################################


